---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveIntersectsSplitFace
source: html/7107d215-872d-1b7f-fd98-e88732923bbf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveIntersectsSplitFace Property

The highlighted line intersects the boundary of the face being split. To split a face at its border, use an open loop that
 ends on the boundary of the face.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveIntersectsSplitFace { get; }
```